{
  "common": {
    "name": "alpha-ess",
    "version": "1.2.1",
    "news": {
      "1.2.1": {
        "en": "Fixed severe error in ClosedAPI",
        "de": "Schweren Fehler in ClosedAPI behoben",
        "ru": "Исправлена тяжелая ошибка в ClosedAPI",
        "pt": "Erro grave fixo em ClosedAPI",
        "nl": "Een ernstige fout in ClosedAPI",
        "fr": "Erreur sévère fixe dans le fichier FerméAPI",
        "it": "Risolto grave errore in ClosedAPI",
        "es": "Error severo corregido en CerradaAPI",
        "pl": "Szczegółowy błąd w ClosedAPI",
        "uk": "Виправлено тяжку помилку в ClosedAPI",
        "zh-cn": "A. 近似严重错误"
      },
      "1.2.0": {
        "en": "Added additional realtime attributes for OpenAPI",
        "de": "Zusätzliche Echtzeit-Attribute für OpenAPI hinzugefügt",
        "ru": "Добавлены дополнительные атрибуты в реальном времени для OpenAPI",
        "pt": "Adicionado atributos em tempo real adicionais para OpenAPI",
        "nl": "Toegevoegd aanvullingen voor OpenAPI",
        "fr": "Ajout d'autres attributs en temps réel pour OpenAPI",
        "it": "Aggiunto attributi in tempo reale aggiuntivi per OpenAPI",
        "es": "Atributos adicionales en tiempo real para OpenAPI",
        "pl": "Dodać dodatkowe atrybuty dla OpenAPI",
        "uk": "Додано додаткові атрибути в режимі реального часу для OpenAPI",
        "zh-cn": "增加开放协会实时归属"
      },
      "1.1.1": {
        "en": "Closed API adapted to latest Alpha-ESS changes and enabled again",
        "de": "Closed API angepasst an neueste Alpha-ESS-Änderungen und wieder aktiviert",
        "ru": "Закрытый API адаптирован к последним изменениям Alpha-ESS и включен снова",
        "pt": "API fechada adaptada às últimas alterações Alpha-ESS e ativada novamente",
        "nl": "Quality over Quantity (QoQ) Releases Vertaling:",
        "fr": "API fermée adaptée aux derniers changements Alpha-ESS et réactivée",
        "it": "API chiusa adattata alle ultime modifiche Alpha-ESS e abilitata di nuovo",
        "es": "API cerrada adaptada a los últimos cambios de Alpha-ESS y habilitada de nuevo",
        "pl": "Zamknięty interfejs API zaadaptował się do najnowszych zmian Alpha-ESS i umożliwił powtórzenie się",
        "uk": "Закритий API, адаптований до останніх змін Альфа-ESS і знову ввімкнено",
        "zh-cn": "适应最近Alpha-ESS变革的贴近性联谊会再次促成了变革。"
      },
      "1.1.0": {
        "en": "Closed API disabled (temporarily?) because API has been changed by Alpha-ESS\nRead back changed settings values 2 seconds after they have been changed",
        "de": "Closed API deaktiviert (vorläufig?), weil die API von Alpha-ESS geändert wurde\nLesen Sie zurück geänderte Einstellungen Werte 2 Sekunden nachdem sie geändert wurden",
        "ru": "Закрытый API отключен (временно?) потому что API был изменен Alpha-ESS\nЧитать назад измененные настройки значения 2 секунды после их изменения",
        "pt": "API fechada desabilitada (temporariamente?) porque a API foi alterada por Alpha-ESS\nLeia novamente os valores das configurações alteradas 2 segundos depois de terem sido alterados",
        "nl": "Omdat API veranderd is door Alpha-ESSS\nLees terug veranderde instellingen 2 seconden nadat ze veranderd zijn",
        "fr": "API fermée désactivée (temporairement?) parce que l'API a été changée par Alpha-ESS\nLire les valeurs de paramètres changées 2 secondes après avoir été changées",
        "it": "Chiuso API disabilitato (temporaneo?) perché API è stato modificato da Alpha-ESS\nLeggi indietro i valori delle impostazioni cambiati 2 secondi dopo che sono stati modificati",
        "es": "API cerrada deshabilitada (temporalmente?) porque API ha sido cambiado por Alpha-ESS\nLea los valores de configuración cambiados 2 segundos después de haber cambiado",
        "pl": "Zamknięty API niepełnosprawny (czasowo?) ponieważ interfejs API został zmieniony przez Alpha-ESS\nCzytanie z powrotem zmieniało wartości 2 sekundy po zmianie ich wartości",
        "uk": "Замкнено API вимкнено (попередньо?) тому, що API було змінено Альфа-ESS\nЧитання змінених значень налаштувань 2 секунд після зміни",
        "zh-cn": "由于Alpha-ESS已改变API残疾(有时?)\n阅读后的环境价值观2"
      },
      "1.0.2": {
        "en": "Updated required node version to 16 or newer",
        "de": "Erforderliche Node Version auf 16 oder neuer aktualisiert",
        "ru": "Обновленная необходимая версия узла до 16 или новее",
        "pt": "Versão de nó atualizada necessária para 16 ou mais recente",
        "nl": "Verouderd vereiste node versie van 16 of nieuw",
        "fr": "Mise à jour de la version node requise à 16 ou plus",
        "it": "Versione nodo richiesta aggiornata a 16 o più recente",
        "es": "Versión actualizada de nodos requeridos a 16 o más",
        "pl": "Wymagana wersja węzła do 16 lub nowa",
        "uk": "Оновлено необхідну версію вершини до 16 або нових",
        "zh-cn": "A. 最新要求的无误版本到16个或新成员"
      },
      "1.0.1": {
        "en": "Adapted fetching energy values using 'Closed API' to latest API changes by Alpha-ESS",
        "de": "Closed API: Energiewerte an neueste API-Änderungen von Alpha-ESS angepasst",
        "ru": "Адаптированные выкачивание энергетических ценностей с помощью 'Closed API' для последних изменений API от Alpha-ESS",
        "pt": "Valores de energia de busca adaptados usando ' API fechada' para as últimas alterações de API por Alpha-ESS",
        "nl": "API verandert door Alpha-ESSS",
        "fr": "Récupération des valeurs d'énergie à l'aide de 'API fermée' aux dernières modifications de l'API par Alpha-ESS",
        "it": "Adattato l'ottenimento di valori energetici utilizzando 'API archiviate' alle ultime modifiche API di Alpha-ESS",
        "es": "Valores de energía adaptados de búsqueda usando 'Closed API' para los últimos cambios de API por Alpha-ESS",
        "pl": "Adapted fetching energy values używając 'Closed API' do najnowszych zmian API przez Alpha-ESS",
        "uk": "Адаптивовані коефіцієнти відтікання енергії за допомогою 'Closed API' для останніх змін API від Alpha-ESS",
        "zh-cn": "利用“无能”的能源价值降低到Alpha-ESS新生动的改变"
      },
      "1.0.0": {
        "en": "Support also the new official OpenAPI provided by Alpha-ESS\nSet state quality accordingly to status of data\nWriting charging and discharging settings implemented for 'Closed API' and OpenAPI\nRemove no more supported states at startup automatically",
        "de": "Unterstützung der neuen offiziellen OpenAPI von Alpha-ESS\nQuality von States wird jetzt entsprechend des Zustands der Daten gesetzt\nSchreiben von Lade- und Entladeeinstellungen für 'Closed API' und OpenAPI implementiert\nNicht mehr unterstützte States werden bei Adapter-Neustart automatisch gelöscht",
        "ru": "Поддержка также новый официальный OpenAPI, предоставленный Alpha-ESS\nУстановите государственное качество в соответствии с статусом данных\nНаписание зарядки и разгрузки настроек, реализованных для 'Closed API' и OpenAPI\nУдалить больше не поддерживаемых состояний при запуске автоматически",
        "pt": "Suporte também o novo OpenAPI oficial fornecido pela Alpha-ESS\nDefina a qualidade do estado de acordo com o status dos dados\nEscrevendo as configurações de carregamento e descarregamento implementadas para ' API fechada' e OpenAPI\nRemover estados não mais suportados na inicialização automaticamente",
        "nl": "Vertaling:\nZet de staatskwaliteit in aanmerking van gegevens\nSchrijven en ontladen opstellingen voor 'Closed API' en OpenAPI'\nVerwijder geen ondersteunende staten bij start-up automatisch",
        "fr": "Soutien également le nouveau OpenAPI officiel fourni par Alpha-ESS\nDéfinir la qualité de l'état en conséquence à l'état des données\nRédaction des paramètres de chargement et de déchargement mis en œuvre pour 'API perdu' et OpenAPI\nEnlever plus d'états supportés au démarrage automatiquement",
        "it": "Supporto anche il nuovo OpenAPI ufficiale fornito da Alpha-ESS\nImpostare la qualità dello stato di conseguenza allo stato dei dati\nScrivere le impostazioni di ricarica e discarica implementate per 'Closed API' e OpenAPI\nNon rimuovere più stati supportati all'avvio automaticamente",
        "es": "Apoyar también el nuevo OpenAPI oficial proporcionado por Alpha-ESS\nEstablecer la calidad del estado en consecuencia al estado de los datos\nEscribir ajustes de carga y descarga implementados para 'Closed API' y OpenAPI\nEliminar no más estados compatibles en el inicio automáticamente",
        "pl": "Wspiera również nowy oficjalny interfejs OpenAPI zapewniany przez Alpha-ESS\nUstalono jakość państwa zgodnie z statusem danych\nPisanie ładowania i rozładowania wdrożonych ustawień API oraz OpenAPI\nRemove nie będzie więcej wspieranych państw",
        "uk": "Підтримка також нових офіційних OpenAPI, що надається Альфа-ESS\nВстановити якість держави відповідно до стану даних\nНаписання параметрів зарядки та відключення, що реалізовані для \"Closed API\" та OpenAPI\nВидаліть не більше підтримуваних держав при запуску автоматично",
        "zh-cn": "还支持阿尔法-萨斯新官方开放协会\n相应地确定数据状况的国家质量\n确定和履行执行的消费和开放的消费者协会和开放协会环境\n自动取消不再支持的开办国家"
      }
    },
    "titleLang": {
      "en": "Alpha ESS",
      "de": "Alpha-ESS",
      "ru": "Альфа ЭСС",
      "pt": "Alfa ESS",
      "nl": "Alfa ESS",
      "fr": "Alpha SSE",
      "it": "Alfa ESS",
      "es": "Alfa ESS",
      "pl": "Alfa ESS",
      "zh-cn": "阿尔法 ESS",
      "uk": "Альфа ESS"
    },
    "desc": {
      "en": "Read and write data from and to Alpha ESS systems.",
      "de": "Lesen und schreiben Sie Daten von und zu Alpha ESS-Systemen.",
      "ru": "Чтение и запись данных из и в системы Alpha ESS.",
      "pt": "Ler e gravar dados de e para sistemas Alpha ESS.",
      "nl": "Gegevens lezen en schrijven van en naar Alpha ESS-systemen.",
      "fr": "Lire et écrire des données depuis et vers les systèmes Alpha ESS.",
      "it": "Leggere e scrivere dati da e verso sistemi Alpha ESS.",
      "es": "Lea y escriba datos desde y hacia los sistemas Alpha ESS.",
      "pl": "Odczytywanie i zapisywanie danych zi do systemów Alpha ESS.",
      "zh-cn": "在 Alpha ESS 系统中读取和写入数据。",
      "uk": "Читання та запис даних із систем Alpha ESS і до них."
    },
    "authors": [
      "Gaspode <gaspode69@online.de>"
    ],
    "keywords": [
      "photovoltaik"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "main": "main.js",
    "icon": "alpha-ess.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/Gaspode69/ioBroker.alpha-ess/main/admin/alpha-ess.png",
    "readme": "https://github.com/Gaspode69/ioBroker.alpha-ess/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "energy",
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=3.3.22"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.1.13"
      }
    ]
  },
  "encryptedNative": [
    "password",
    "appSecret"
  ],
  "protectedNative": [
    "username",
    "password",
    "appID",
    "appSecret"
  ],
  "native": {
    "username": "",
    "password": "",
    "systemId": "",
    "enableRealtimedata": true,
    "intervalRealtimedata": 30,
    "enableEnergydata": true,
    "intervalEnergydataMins": 5,
    "enableSettingsdata": false,
    "enableSettingsCharge": false,
    "intervalSettingsChargeMins": 5,
    "enableSettingsDisCharge": false,
    "intervalSettingsDisChargeMins": 5,
    "intervalSettingsdataMins": 5,
    "enableStatisticalTodaydata": false,
    "intervalStatisticalTodaydataMins": 5,
    "enableSummarydata": false,
    "intervalSummarydataMins": 5,
    "updateUnchangedStates": false,
    "appID": "",
    "appSecret": "",
    "apiType": 1,
    "oAEnableRealtime": true,
    "oAIntervalRealtime": 30,
    "oAEnableEnergy": true,
    "oAIntervalEnergyMins": 5,
    "oAEnableSettings": false,
    "oAIntervalSettingsMins": 5,
    "oAEnableSettingsCharge": true,
    "oAIntervalSettingsChargeMins": 5,
    "oAEnableSettingsDischarge": true,
    "oAIntervalSettingsDischargeMins": 5,
    "oAEnableStatisticsToday": false,
    "oAIntervalStatisticsTodayMins": 5,
    "oAEnableSummary": true,
    "oAIntervalSummaryMins": 5,
    "oAEnableWallbox": false,
    "oAIntervalWallboxMins": 5
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "Device or service connected",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ]
}
